In [1]:
#Agenda
#Check for null using isnull()
#Series- dropna()
#DataFrame- dropna()
#Disadvantages of dropping all NAN values in DataFrame
#DataFrame- dropna() with how parameter
#DataFrame- dropna() along column
#Dropna with thresh parameter
#fillna() function

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
revenue_series= Series([100,200,300,np.nan], index=['Audi','Mercedes','BMW','Toyota'])
print(revenue_series)

Audi        100.0
Mercedes    200.0
BMW         300.0
Toyota        NaN
dtype: float64

In [4]:
#Check for null using isnull()
revenue_series.isnull()

Audi        False
Mercedes    False
BMW         False
Toyota       True
dtype: bool

In [5]:
#Series- dropna()
revenue_series.dropna()

Audi        100.0
Mercedes    200.0
BMW         300.0
dtype: float64

In [6]:
#DataFrame- dropna()
df1= DataFrame(np.random.randn(12).reshape(4,3))
print(df1)

          0         1         2
0  0.156564 -0.041172 -0.101404
1  0.694761 -0.858992 -0.841382
2 -2.029875  1.348982  0.365561
3  0.186880 -0.927164 -0.853059

In [7]:
df1.loc[1,2]= np.nan
df1.loc[2,1]= np.nan
#df1.loc[3,]= np.nan
print(df1)

          0         1         2
0  0.156564 -0.041172 -0.101404
1  0.694761 -0.858992       NaN
2 -2.029875       NaN  0.365561
3  0.186880 -0.927164 -0.853059

In [8]:
df1.dropna()

          0         1         2
0  0.156564 -0.041172 -0.101404
3  0.186880 -0.927164 -0.853059

In [9]:
#Disadvantages of dropping all NAN values in DataFrame

In [10]:
#DataFrame- dropna() with how parameter
df1.dropna(how= "all")

          0         1         2
0  0.156564 -0.041172 -0.101404
1  0.694761 -0.858992       NaN
2 -2.029875       NaN  0.365561
3  0.186880 -0.927164 -0.853059

In [11]:
#DataFrame- dropna() along column
df1.dropna(axis= 1)

          0
0  0.156564
1  0.694761
2 -2.029875
3  0.186880

In [12]:
#Dropna with thresh parameter
df2= DataFrame([[1,2,3,np.nan],[4,5,6,7],[8,9,np.nan, np.nan],[12,np.nan, np.nan, np.nan]])
print(df2)

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [13]:
df2.dropna(thresh= 3)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [14]:
df2.dropna(thresh= 2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0
2  8  9.0  NaN  NaN

In [15]:
#fillna() function
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [16]:
df2.fillna({0: 0, 1: 50, 2:100, 3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0